#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-yZGmf5BSgnAiFWBa

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_iam_user.schutzbot_webhook_sqs: Refreshing state... [id=schutzbot_webhook_staging]
aws_sqs_queue.schutzbot_webhook_sqs: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/schutzbot_webhook_sqs-staging]
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=staging_internal]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=staging_external]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=composer_syslog]
aws_cloudwatch_log_stream.internal_worker_syslog: Refreshing state... [id=worker_syslog]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_staging]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=composer_syslog]
aws_cloudwatch_log_stream.external_worker_syslog: Refreshing state... [id=worker_syslog]
aws_iam_policy.schutzbot_webhook_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/schutzbot_webhook_sqs_staging]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_staging]
aws_sqs_queue_policy.test: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/schutzbot_webhook_sqs-staging]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_staging-20210127130509124000000001]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_staging-20210127132820714600000001]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_staging-20210127150546817300000001]
aws_iam_user_policy_attachment.schutzbot_webhook_sqs: Refreshing state... [id=schutzbot_webhook_staging-20210209202243620200000001]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_staging-20210127152215239700000003]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_staging-20210127152215216300000001]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_staging-20210127152215237300000002]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_staging-20210127152215241500000004]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=7ae0421e-5c59-4b9e-971a-aab448662f51]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_instance.composer_internal: Refreshing state... [id=i-0f2a613e34ee8496a]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_external: Refreshing state... [id=i-035379ae62f35ce17]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-1911393042]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-a007db26-c324-4b9d-8caf-cf37b637254d]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-2376940936]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-2f29a128-797e-4240-8e9c-cd8e4b24b5e6]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_cloudinit_config.external_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "external_workers_cloud_init"  {
      ~ id            = "1384655871" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R4a4+rOLb290j9H3jTW3pntA8JlyRVqelqTUggV0gwGAJzRpEBJxAcoMDktnv/9yNyqaldu3bPjOZIR11fUrbXzY+f5bVMP00oTihrnjL8xOxKQqMM5bS5i444+AvjpWUSoPz0XFfHqizNoTboAadeq0ashfMiSpMnhm9wP9V+qrHsW6Gfanfbg6jI0iKiF1lEKfLDHU7oX5h1RHCCdvi5HiURbfjrTf0fWmaOkmKNc1ZO/DSIks0T8+BF9I3AJWSKj7Tpk7QMWD9N1tHmp5oa7fB3wf38VqZWKwucF081hmGZKoInBvsCW03WGIZhiiJcoZKGaR6dcbCK8ekiW/2xTL0oQjYvENPr9XqSqJ1Rnz/5glwNBz29J/V6vX5P7x+3a2U8JsN1P+lGPhmddnYuS7kJBTLr0NgYmjzOHoL+4nzgt07HTkKdLJZqhhd5pB21JRk++va82wRKJgXcuasctNPneL0Ju+vypDmt7vizijrzk2lJm3aopcpxDZbDdjSiftPQSeLJSjTNjLhFoixt6S6V6G7Te9nERq8zOIenjdcp22o3OprjY8uWtqWhcsOlfta2GV6fIrv8XIzB51CAuR5Pe1JZjh3dy7fksxJaOzTb5/uTORfKYk73iSNtQ29xOM0fBHuxRdk0aHZDE70sZP6gnDpQEZKl31psDtwm0r1OEXmKeX7QTHy0xbbefXzJ9LmtOlM/27g5MdBoNHUNNaTn+YMauPl8psBlavA93Du1NiH1tXwumcRrG/vFg3g+cy8SUAS/P2/NuUPWPhxeFuH+ICTUEzNztqABppPPVpvTF0mWLE+GkbiZcFYOPhZ4b3nsPCRhlyThLHc3W/zgp3qy6CnHpk/EjmxMTpuoXPjS4XPMPzolcdQlfEESjQ+TWQy2g2xrLgXcVid8Jx08FJOR32ra7fi0nu0DtbDC4IXvL0dDy5pn53Tjcd225UQcWCpZ4oImj61Nvwk+29aJOmvnkcvX1twPeqkwdNfJpH12AFxOJl3VjVFyPIryA5xHsTzRugXcChx37vRPJ268Hr+Y3oSX2uuHdSAiH+Sz1sB3YKCMm7x00uyOwm8ffDfqDeeTqeadlwpninT9eOQwrz8/Mzu0TfO/5jgIEW346a7+Ld9xILTbfPfC+f6V88QdjHnNlNvV3Hgh8VuFtLKOYkrRcWR2DvO4s3xMtk33AacLTZebKneYth7bUyb1ygBF3zirHfKI4lV1I9zSMkM0fGKadJdd03tV3RGrPcqLS2T+9RZ4Yn67BTo3JDieDVb9uaqOzedH0UfrR47DbaEttLwW31o/rNveuo0wF4h+lxf8xy7fFW7a/bm6mBsyuKs/rNtY7ARBt/XIt7k18lseJ3bEjt8JxK7nPXSwgB/5YP3eeW/Vl4H5PDM4OjP4PoDBxIykAbAm0IDuROcUCC5rHO3H/MSAQLZkbaDb7tLlFNGAE8nliAUHmq4KzlmzpCGM27wnuBzeqW1zEAtgGEJPAFLAAWDDbObx2QSN3K0ZKwDAw1QnihRw7guwLE2PyUg3FQtARQy4Y6Ry7cxVgsLns4G2dLeerYnGMNyaMf+iL4OFJVsd0wIuhrxsmdoSDbW5ucyk4JBVa61v1mJlaVoTEHBWYkNgQ0uRgaxwwU49GVsltMQwN4dcG1tZR+c0CXJEBIriGjHd2zFJg502719invQhVGRXCBQoK/JF1u4OqrEeK5qeSLltKY5haapzDme2nWnQIglOJDCHmqTyk5m6C8ZgIB2dpXIOtpupY022VqwKGlHbbhweAYRHBI+WLT+K6mAC8NY6IyFLVTE7miMygttQhMTZzwRtotrjo7+VLGxlpsMdkcr7omVlJ/2QctoA7BwxPZtL0vIUrWPxlgt5KdFjMkPDQJqPFOqTzFDt7s6xwQmPLMPs07MXu7Jh05Yq+rlzVqauZZXqTitUJcj6xOLswWQEeHcASKCZgrJ3Y5DbijUAiTUzRsEU2sHQHIGzIWvItrVdQALbUDKkxa1WwAUHlSjINsdt5xzy3lJ6Ua3eFMpuYctqyx0qyJT50FZIBExJM5bAVmVtbCSSCDhycBJSehaBXp+eQWIJ3gDsrSF/wqN0j5dhx5eBYMX8wo+ViadnLU8oRJ9Y1BpZMRhaCuQnfVMIJBVS3oG8YY2s0FhKwDtPYk90j9Nz7wh2zlmHrZMFNSngLEm3lbkl80OwDMbQInKfuIYqd/s6IQqIU9E1XUcV44M77Ba+0Z06xM2cmGSBAErI93It5vtzOZBUy4qNZQBsyPcdqAyNbUA0sjljU4o94TD9ga501wXLQNGjrgihq+mQ7+u20/o4r46vHNU3mQSSTNAEQgzOb3tKNvPj8cm0eYRk5WjIRMX2MTRFYvumL4Iz6ZvWBIJEO9gJ5NTRWAQ8EB0OpMFuwwOo7Q1Fifq7Yx6YkqPBruNyQLBHWt8fdofGaCKoMl0Y9tHUeGuqLp2DNiz2BiGJPfJzb5hBa6Tu58vs4G1Dw9odqT+Ce8DxC9OEU2hPRrBP52hrIf9s7QDnLpHcEk1zzEObWvPBZOqNQmLESgGX4VgXjgM4tFow1jTHVNrasidaw3YyH0gzgwQctiR9rmccFAJNT3qiZlmGaz9yGoQtKGcnI+md0YjsNWXSmlsTAAR6wrZmGMtgp8ehgMRQM3Zu6QuqaBtdQbMJD7YhxTLf6W81zonT9pTL2gAqvDFKj04c8D7UnKmoTKEFYNDvAu/snII4WDowbkPenTlEbTlWqOrnyVxLlC2yJ0d/C1vuFshGrE+NRCtM41H0R1rb3yp7bQk4J56UGol5fal2+9H1TgawLY9lTYEETEBMBroFlOtdzk3fV4rR3DCf8ZHiPEGkUVC0iZJNVc2ytMB5Iy28MiJBI8037zV7gwGQDeOZfxAaIt/otBo8f5Ox52Aqg5VhzFZT2TFWPaA9ozx5QofiqcB+jmmxQwna4PypLFiMCsryT11RfGgLfPeh2+3epJ4KnO8jH196V3YsDEU7vbkwoGT0wXhhjufaSu1pveGt7PW0wX/gr/QKP4+yqstnbyqsn+52KAnYWHdI2r37dwxTVi/waT1VXi2ArIyXzzcA2Tui7CHN41s//ga7wRg8NzH1mzd82Tvgd+tyH8im8boxWRss5mPNXEEwew4pzYqnZvPbnTVed9ZAO3ROE3QoqnNsvu1DPnL53USDpjvycXvytzjdRn+/DRAh6QEHqyDdoSgpmGfmb0ydYrR7y5r6fzH1sPQaXo4P7+ev2Hy/xNw9+Ih5ZuofR+0j1s9pI8NV33WL7mrw347vfy2Od0jvsU/T/Pbze6gWaZn7uGhs07IiTXD3S08Zrjzf5+/tLD76pAzwqkwietlX/ebjli/1v79CUkRJXDTSkr63iQ7F6tKSHhD1wxVJN8XdfJRkJb3h9er6FQycBFkaJbQycqdipf1DAt7NbvK0zFbVQ7VSvWXK6p4pd6mC5hjtXsWuZ7MqTgVJN6/7vz2mG34aYP+CUJEm9VotLxN/F1xb7+JUULzzKWFwgjyCGZZN0gNzRep3Hvr/zpP9yBYhJuR6Z/zozf7/ml6UND1UhLUCU4bFZcpkUYbXKCK169F//EKo/cwMMWVoiJkoKShKfMyMB43aWDPMntaXV+PB86c/+WVOGHZWMNVhPDWbfKfbENqtxu23SRDFBW3uMEVsgChq3m2xUfDnykevKPCuAihMC1rh3qgpcDZ7vdue65++fHzdfWU/fXkTzNd6ZW6RV+RIy2vgCT68sYv9MGXqBqY0Sja3E3pdZmjKfPryjeuvjYtJ44bCO4VG7f5fdcoFpuyrqU/fmPljnPYNnGsJ8iqAXk+dpgwYaVcwAN5EBcX5t7w4RDS8yNSaZZE3SeojcokEHQrm20rBbDBlr1PsHpESM/9dJQx7T2y2ItSnL79Xg77eVG5WoqCS/ycV+SvzG7N9YdicqTeMi55B8yjZ1Jlfr4C8Lb6rW6yrW/FtVAleu6v/nmT9XzTG/MZcDinfMez6Xw2g9lGDcPsayLAsKmn6R+LaAGckPTFVd8Ws05y5XrbFlWe3xYpl92LH9HuMj3MarSMfUdyoeajAnRbDBgzL/PLLL8ynL+++IXxlfmU+fXnb93x9UzF/5CbGJwYlwbe+/q94/UEz+0+pfKtaFbDfMvcfC/WPJa+0fAX1e/SuCmyMTxcE3xn2c/ofGr4fzZu8+G43fzyKX/qxqjp8QPSqupTZG5Haz4w5H8z/tAvRKcDJn58YuypkOKjuYT9N9jiv6lFUVOOBZjBVic2ZQ4gT5oAZgsrEDxs1H9FLUtTfIH17NH19i35Vpb7WmV9/fRvCHwjiezkvsxuuzK0NveG7yHGGcsy8b53/f8HkeJdS/F7tkvtF6seYFo3aD/q4u7Wrids766/vYX16fOC478Bk2Z9q/xMAAP//DG/AwDQaAAA=" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=external.staging.composer.osbuild.org
                      COMPOSER_ADDRESS=172.31.64.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:service_keys-I2G3Wo
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/vector/vector.toml
                    content: |
                      [sources.journald]
                      type = "journald"
                      exclude_units = ["vector.service"]
                
                      [sinks.out]
                      type = "aws_cloudwatch_logs"
                      inputs = [ "journald" ]
                      endpoint = "https://logs.us-east-1.amazonaws.com/"
                      group_name = "staging_external"
                      stream_name = "worker_syslog"
                      encoding.codec = "json"
                
                runcmd:
                  - systemctl enable --now vector
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
          ~ content      = <<-EOT
                #!/bin/bash
                set -euo pipefail
                source /tmp/cloud_init_vars
                
                echo "Setting up worker services."
                
                # Prepare osbuild-composer's remote worker services and sockets.
                systemctl enable --now osbuild-remote-worker@${COMPOSER_HOST}:8700
              + 
              + # Now that everything is configured, ensure monit is monitoring everything.
              + systemctl enable --now monit
            EOT
            # (1 unchanged attribute hidden)
        }
    }

  # data.template_cloudinit_config.internal_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "internal_workers_cloud_init"  {
      ~ id            = "3169933157" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R4a5OjOJb2d0f0f+B1V8Q7E7XYXIwzndPZMcYGX8FGIDDMTjgEyAYjAwnytbr++wa+5GRmVdfM7G7ERucXJ9I5zzk8eqRzRC9LKU4pa51y/MRsd4TGOSpocxsfcfgXxs92aYiK03NdG2mKPIN6vwvceq16Ym1clHGWPjF8g/up9lONZd8a/VS7Y/fjMs/KmF5sEaUoiLY4pX9hVjHBKdri53qcxrQRrNb1f3hZBUrLFS5YJQ2yME7XT8yDH9M3BpeUKT7SZkCyXcgGWbqK1z/VtHiLv0nu57c2tdquxEX5VGMYlqkyeGJwILDVYI1hGKYsoyXa0Sgr4jMOlwk+XWyrP5apl2XEFiViut1uVxb1M+rxp0BQqsd+1+jK3W631zV6x81KHY3IYNVLO3FAhqetUyhyYUGBTNs0MQcWj/OHsDc/H/iN23bSyCDzhZbjeRHrR31BBo+BM+s0gZrLIXfuqAf99DlZraPOanfS3VZn9FlD7dnJsuW1FOmZelyBxUCKhzRomgZJfUWNJ7mZtEicZy3DozLdrrsv68Tstvvn6LT22ztJ68RHa3RsOfJmZ2rcYGGc9U2OV6fY2X0uR+BzJMDCSCZdebcbuYZfbMhnNbK3aLov9idrJuzKGd2nrryJ/PnhNHsQnPkG5ZOw2Yks9DJX+IN6akNVSBdBa74+cOvY8Ntl7KvW+UG38NERJaPz+JIbM0dzJ0G+9gpiouFw4plaRM+zBy30itlUhYvM5Lu4e2qtIxroxUy2iC+Z+/mDeD5zLzJQhaA3a824Qy4dDi/zaH8QUuqLuTWd0xDT8Wdb4ox5mqeLk2mmXi6c1UOABd5fHNsPadQhaTQtvPUGPwSZkc676rEZELGtmOPTOt7NA/nwOeEf3R1xtQV8QTJNDuNpAjb9fGMtBCxpY76d9R/K8TBoNR0pOa2m+1Ar7Sh84XuL4cC2Z/k5W/tcR7LdmAMLNU890OSxve41wWfHPlF35T5yxcqeBWE3EwbeKh1LZxfAxXjc0bwEpcejqDzAWZwoY71Two3Aced273TiRqvRi+WPeVlaPaxCEQWgmLb6gQtDddTk5ZPutFV+8xB4cXcwG090/7xQOUukq8cjh3nj+ZnZok1W/LXAYYRoI8i29fd6x6EgSXznovneVfPE64943VKkamw0l/mNSlp5W7Xk+Di02odZ0l48ppum94CzuW4oTY07TFqP0oTJ/F2I4nfBaocipnhZnQi3bZkjGj0xTbrNr9t7WZ0Ryz0qyktmwfUUeGJ+uyU6M2U4mvaXvZmmjaznRzFAq0eOw5IgCS2/xbdWDyvJX0kIc6EYdHgheOzwHeHm3Ztp85mpgLv7w0rCYjsMO61HXuJWKGj5nNgW20E7FDu+/9DGAn7kw9XH4N1lTwHW89Tk6NTkewCGYyuW+8AeQxN6Y4NTIbjMcbSX8GMTAsVW9L7heAuPU0UTjmWPIzbs64YmuGfdlgcwkXhf8Di81SSrnwhgEEFfAHLIAeDAfOrz+RgNvY2VqADAw8Qgqhxy3guwbd1IyNCwVBtAVQy5Y6xxUu6pYRnweV9feBvf0UVzEG2shH8xFuHcVuy2ZQMPQ16xLX2BBvrMWuRyeMiruda7uURdWPYYhJydOhA40FYVoKhcuNVO5kaNbDEqrAEnYTtvG5wuQ46IQFU9M6F7JyFZuNVnvUvO4x6EquIJoQoVVbnYOp1+9Wwkqm6kcuHYqmvauuaeo6nj5Dq0SYpTGcygLmv8eKptwxHoy0d3oZ7DzXri2uONnWiCTjTJS6IjgPCI4NF2lEdR648B3thnJOSZJuZHa0iGcBOJkLj7qaCPNWd0DDayje3ccrkj0vhAtO38ZBwyTu+DrStmZ2tBWr6qt23e9iAvp0ZCpmgQyrOhSgOSm5rT2boOOOGhbVo9evYTTzEd2tLEoHDP6sSz7Z221UtNDfMesTmnPx4C3usDEuqWoO69BBSOavdBak/NYTiBTjiwhuBsKjpyHH0bktAx1RzpSasVcuFBIypyrJHkniPeX8gvmt2dQMUrHUVreQMVWQofOSqJgSXr5gI4mqKPzFQWAUcObkp2vk2g36NnkNqC3wd7e8Cf8DDb40XUDhQg2Ak/DxJ17Bt5yxdKMSA2tYd2Aga2CvlxzxJCWYOUdyFv2kM7Mhcy8M/jxBe94+TcPYKtezZg62RDXQ45WzYcdWYr/AAswhG0idIjnqkpnZ5BiAqSTPQsz9XE5OANOmVgdiYu8XI3IXkogB3ku4We8L2ZEsqabSfmIgQO5HsuVAfmJiQ6WZ+xJSe+cJj8jq989wWLUDXijgihpxuQ7xmO2/r+vjq+atRY5zJIc0EXCDG5QPLVfBoko5Pl8Agp6tFUiIadY2SJxAmsQARn0rPsMQSpfnBSyGnDkQh4ILocyMLtmgdQ35uqGve2xyK0ZFeHHdfjgOAM9V4w6AzM4VjQFDo3naOl8/ZEW7gHfVDuTUJSZxgU/iCH9lDbzxb5wd9Epr090mAI94Dj55YFJ9AZD2GPztDGRsHZ3gLOWyClJVrWiIcOtWf98cQfRsRM1BIuopEhHPtwYLdgouuupUr6oivaAymd9eWpSUIO27IxM3IOCqFupF1Rt23Tcx45HcIWVPKTmXbPaEj2ujpuzewxAAI9YUc3zUW4NZJIQGKkm1tvFwia6JgdQXcIDzYRxQrf7m10zk0yacLlEoAqbw6zo5uEfAB1dyKqE2gDGPY6wD+7pzAJFy5MJMh7U5doLdeONOM8numpukHO+BhsYMvbAMVMjImZ6qVlPorBUJeCjbrXF4Bzk/FOJwlvLLROL76eyQBKykjRVUjAGCSkb9hAvZ7l3ORjpRjOTOs5TikuUkQaJUXrOF1X1SzPSlw0stLfxSRsZMX6o2e33weKaT7zXEPkGvxjg+dvJs4MTBSwNM3pcqK45rIL9GdUpE/oUD6VOCgwLbcoRWtcPO1KFqOSsvxTRxQfJIHvPHQ6nZvVk1/gw6VvZR9UiDG54ZtQNntgNLdGM32pdfXu4Fbyunr/vx+s3PllUMR51eGzNxc2yLZblIZsYrgk69zju6alaBfq9K6mLOdAUUeL5xt57J1N9pAVya0Xf8NbfwSem5gGzRu37J3sO7rSA4plvr6Yovfns5FuLSGYPkeU5uVTs7nPA8xyIS/yUkvk2lKr4/NByHbOx+LhLO0b79+88frmjcqxgbbonKXoUFYL3XzbqHwvr28GGjTbku/3L39Lsk3899sDIiQ74HAZZlsUpyXzzPyNqVOMtm9lVf8Pph7t/Ea11h/HrwR+O8XcIwSIeWbq3886QGxQ0EaOq8bslt0V8N/O738tjw9M73FAs+L28yNWy2xXBLhsbLJdpazwHpeeclxFvo/f+118DMguxMtdGtPLe9VvMUpc7OMA1//+SkkZp0nZyHb0IyY6lMtLz3pANIiWJFuXd/g4zXf0xtdr6FcycBrmWZzSCuS9XnnMibyPJE4Ukc8FEotf9uvsuBcaFfqPVXqPvS6yXb6srrsV/m3PLe977m5V0gKj7avZdQGX5akk2fqVpNuVvBFkIQ4uNJZZWq/Vil0abMNrA1+eSoq3ASUMTpFPMMOyaXZgrnT+4HPBv3PxP7JlhAm5nj6/d/P/f00/Tps+KqNaiSnD4l3G5HGOVygmtas+vn/PqP3MDDBlaISZOC0pSgPMjPqN2kg3ra7eU5aj/vOnPwW7gjDstGSqFXtqNvl2pyFIrcbtt0kQxSVtbjFFbIgoat6x2Dj8cxWjW5Z4WxEUZSWteG/UVDidvp6Sz/VPX75/cH5lP315k8zXegU3LyoFZbtr4ik+vMHFQZQxdRNTGqfr2wq9TjM0Yz59eRf6a+MCad5Y+ODQqN3/q1a5xJR9hfr0DuaPsdo3cq7FzK8Iel11mjFgqF/JAHgdlxQX73VxiGl0sak1d2XRJFmAyCUTdCiZ9zWFWWPKXofYPSI7zPxntWHY++5nK0F9+vKjavb15nJDicPK/p/U9q/Mb8zmhWELpt4wL34mLeJ0XWd+vRLytowvb7kub2W8UW3w2t39R5b1fxGM+Y25LFKxZdjVv5pA7Xutxu2bIsOyaEezP5LW+jgn2Ymp+jRmlRXM9bAtrzq7TVYqu1dEptdlAlzQeBUHiOJGzUclbrcYNmRY5pdffmE+ffnwJeIr8yvz6cvbDurrm7L6e2ESfGJQGr6P9X+l6+/0xP9UyreqVRH7Xrn/mKh/3/Iqy1dSv2Xv6sAm+HRh8ANwUND/IfB9ad7si2/e5o8n8UvTVlWH7wi9qi67/I1J7WfGmvVnf9pG6BTi9M9PjFMVMhxW53CQpXtcVPUoLqvnvm4yVYktmEOEU+aAGYJ2aRA1agGil01Rf8P07er19S37VZX6Wmd+/fVtCn8giu/lfJffeGVuveqN33mBc1Rg5mN//f9LpsDbjOKPbpe9X2ZBgmnZqP1OH3dHu0Lcbmx//Ujr0+MDx31DJsv+VPuvAAAA//8PyKwZehoAAA==" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=internal.staging.composer.osbuild.org
                      COMPOSER_ADDRESS=10.30.18.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/vector/vector.toml
                    content: |
                      [sources.journald]
                      type = "journald"
                      exclude_units = ["vector.service"]
                
                      [sinks.out]
                      type = "aws_cloudwatch_logs"
                      inputs = [ "journald" ]
                      endpoint = "https://vpce-01e031ba5033ab0c5-eqvgoxv2.logs.us-east-1.vpce.amazonaws.com/"
                      group_name = "staging_internal"
                      stream_name = "worker_syslog"
                      encoding.codec = "json"
                
                runcmd:
                  - systemctl enable --now vector
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
          ~ content      = <<-EOT
                #!/bin/bash
                set -euo pipefail
                source /tmp/cloud_init_vars
                
                echo "Setting up worker services."
                
                # Prepare osbuild-composer's remote worker services and sockets.
                systemctl enable --now osbuild-remote-worker@${COMPOSER_HOST}:8700
              + 
              + # Now that everything is configured, ensure monit is monitoring everything.
              + systemctl enable --now monit
            EOT
            # (1 unchanged attribute hidden)
        }
    }

  # data.template_file.external_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "external_workers_cloud_config"  {
      ~ id       = "d3da00eef76c5086b070fe65de6b25fe5d87b2295804df95e364f02bfdc9333b" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=external.staging.composer.osbuild.org
                  COMPOSER_ADDRESS=172.31.64.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:service_keys-I2G3Wo
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/vector/vector.toml
                content: |
                  [sources.journald]
                  type = "journald"
                  exclude_units = ["vector.service"]
            
                  [sinks.out]
                  type = "aws_cloudwatch_logs"
                  inputs = [ "journald" ]
                  endpoint = "https://logs.us-east-1.amazonaws.com/"
                  group_name = "staging_external"
                  stream_name = "worker_syslog"
                  encoding.codec = "json"
            
            runcmd:
              - systemctl enable --now vector
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "172.31.64.11" -> (known after apply)
            # (10 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # data.template_file.internal_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "internal_workers_cloud_config"  {
      ~ id       = "7adeed9dad1c58985e93bcbf2a4946764e40e85a164d5612f24fced7ab3f34ce" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=internal.staging.composer.osbuild.org
                  COMPOSER_ADDRESS=10.30.18.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/vector/vector.toml
                content: |
                  [sources.journald]
                  type = "journald"
                  exclude_units = ["vector.service"]
            
                  [sinks.out]
                  type = "aws_cloudwatch_logs"
                  inputs = [ "journald" ]
                  endpoint = "https://vpce-01e031ba5033ab0c5-eqvgoxv2.logs.us-east-1.vpce.amazonaws.com/"
                  group_name = "staging_internal"
                  stream_name = "worker_syslog"
                  encoding.codec = "json"
            
            runcmd:
              - systemctl enable --now vector
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "10.30.18.11" -> (known after apply)
            # (10 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-035379ae62f35ce17" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-035379ae62f35ce17" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-34-234-177-181.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "34.234.177.181" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9RZ6XLiSLb+T0S/Q467ImYmagSSWGzc7YlBILFKgFZE3w4ipUyQUGqxMsVWXe9+Qyxuu8rVy42JuDP+A1KeLU9+55wvcTdNGE4YZx4z/AjigrAwgzmrxeEBox+AlxYJgvnx6U4dqrI0tbReR3fvKuUTZ+OchmnyCIQq/13luwrHvRb6rnKz3QtpltKQnWUhY9APYpywH8A6JDiBMX66C5OQVf315u5XLTOHCV3jnJMTP0VhsnkE917IXgmcQ2b4wGo+SQvE+WmyDjffVdQwxl8F9/1rmUqloDinjxUAOFBG8AiwL3LlywoAAFAarGDBgjQPTxitInw8y5Z/HLijNOByCkGn0+lIde0Eu8LRF+XysdeZd6ROp9PtzLuH7VoZDkl/3U3aoU8Gx9jJZSk3LZFMWiwy+qaAs3vUnZ32wtZtOUkwJ7OFmuFZHmoHbUH6D74zbdd0JZMQf2ore+34MVpvgva6OGpuoz38qMLW9Gja0qYZaKlyWOuLfjMcML9mzEniyUo4zoyoQcIsbcyXTGLxpvO8iYxOq3cKjhuvVTTVdngwh4eGI20LQ+X7i/lJ22Z4fQyd4iMd6h8D0crn0bgjFcXQnXv5lnxUAjuGk12+O5pTsaBTtktcaRt4s/1xei86sy3MxqjWDkz4PJOFvXJsWYqYLPzGbLPnN+Hca9HQU8zTvWbig1NvztsPz9l86qju2M82y5wYcDAYLw01YKfpvYqW+XSiWIvUEDq4c2xsAuZr+VQyidc0drP7+unEP0u6IvrdaWPK77Pmfv88C3Z7MWFePTMnM4YwG320m/x8lmTJ4mgYyTITT8rex6LgLQ6t+yRokySY5MvNFt/76TyZdZRDzSf1lmyMjpuwmPnS/mMkPLgFcdWF9QwlFu1Hk0jf9rKtuRBxUx0JrbR3T0cDv1FzmtFxPdkhldoBeha6i0HftqfZKd14fLtpuyGvL5QsWeo1Adubbk3/6NhH5q7dBz5f21MfdVKxv1wno+bJ1a3FaNRWlxFMDoe6fG9Nw0geaW1qbUWeP7W6xyM/XA+fTW8kSM31/RrVoa/nk0bPdy2kDGuCdNScliJs7/1l2OlPR2PNOy0U3qyz9cOBx8L86QnEcJvm/8oxCiCr+ml89xbvGInNptA+Y757wTxZ9oaCZsrN8t1wJglbhTSylmJK4WFgtvbTqLV4SLa15T1OZ9pcrqn8ftx4aI5B6hUIhm+cVfZ5yPCq7AjXsswgCx5BjcXZpbxXZY9Y7WBOz5H5ly7wCH65Bjo1JGs46a26U1Udmk8PdR+uH3geN8Wm2PAaQmN9v2566ybEPKr7bUH0H9pCW7xqd6fqbGrI+k39ft3E9RZC7caD0OTX0G94fL1Vb/ktVG973n0Li/hBQOsvnXdWXVk3nyYGzyaG0NUtNDJDqafbI8uwlqM5r1j6eY1n3UgYGZYu27LWmzvLxZJX6oY1kpY8sa2eNldF96TZUt+KmoInLnkcq02zF4l6P7A8UZcQr+uOlU08IRvBwXJrRoquW/vxnCgS4pfPum1r84gM5qZi65ZSR/whVPlmtlQQ9YWspy2WW8/R6kY/2JqR8DxfoJkt2y3T1pfYEmTb1Bawr03NRSahfVauNd6sRcrCtEc64u3EsXTHshVZlxUexerR2CqBXQ9ys883sZ215rwmWTyp64qyNCK2cyKSolibds8xj7qWpchLESmWrMhnWafdK5/nkaLNEyl3bMU1bE11T8HEcTLNskmCE0mfWpqkCqOJGqOh3pMO7kI5oe1m7NqjrR2pokbU5jIKDrplHaB1sB35oa72Rjre2icoZqlazw7mgAysbVC3iLubiNpIdYYHfyvZ2M5Mlz9AVfDrtp0d5/uU13p67NbTk7kgDU/RWrZgLy1BSuYRmcA+kqYDhfkkM1SnHbuOfsQD2zC77ORFS9lwWEOt+7l7UsZL2y7UWKOqgrIusXmnNxrowrKnE6SZorJbRnruKHZPT+yJMUBjy0F9c6CfDFmDjqPFiCDHUDKoRY0G4tFeJQp0zGHTPQWCt5CeVbsztuQldWS1sewr0JSFwFFIqJuSZix0R5W1oZFIdZ0nezchhWcTy+uyk57YotfTd3ZfOOJBusOLoOXLumhHwsyPlJE3zxqeSOs+sZk9sCO9byuWMOqaIpJUiwmuJRj2wA6MhaR7p1Hk1ZeH8alz0GP3NLcaR9vSJMTb0txRprYs9PUFGlo2kbtkaahyuzsnRNGjtL40l65aj/bLfpv6RnvskmXmRiRDol5YQifXIqE7lZGk2nZkLJDuWELXtZS+sUVEI5sTNqXIE/fjb+hKN119gZR52K5b1lKbW0J37riN9+vq8ILR+SaT9CQTNZEQg/ebnpJN/Gh4NB0BQlk5GDJRsXMIzDpxfNOv6yfSNe2RpSfa3kksXh0M67qg111eT1G8EXRL2xmKEnbjQ45MydWstrvkddEZaF2/3+4bg5GoymxmOAdTE+yxunD3Wp/uDEISZ+DnXj+z7IG6my6yvbcNDDs+MH9g7XRemJmmNbac0cDqsinc2tA/2bHOLxdQbtRNcyhYDrOnvdHYGwTEiBRqLYLhXDz0rL7dsCJNc02lqS06dbvfTKY9aWIQxGNbmk/nGW+JSJsnnbpm28bSeeA1y2pYcnY0ks4JDshOU0aNqT3SdZEdsaMZxgLF8ygQYT3QjHhZ+KJad4y2qDlE0LcBw7LQ6m413o3S5pjPmrqlCMYgPbgREnxLc8d1ZWzZuoW6bd07uUcUoYVrRU1LWE5cojZcO1Dnp9FUS5QtdEYHf2s1lltdNqL52Eg0ahoPdX+gNf2tstMWOu9Go0IjkTBfqO1ueOnJutWUh7KmWEQf6RHpzW1dufRyfvzlpDCMyWosu8aqo2tPME8e4Z4+UuznmNEYJnCD88eCchhSxgmP7Xr9vikK7ft2u32VesQHhvMEkpWfxllKcX5mmtymKfMb8+rOsCSjqw9n5nCqrdSO1ulfh1RH6/3fPdPCo34eZiUn564qnJ/GMUwQF81dkrZv/l3DlNXVYGqYWkeVVzNdVoaLJ8rgJkw23G0L3G0LX2apN9Sfapj5tZR6RUjQl4KG3NVl03jZmqz1ZtOhZq4sffIUMJbRx1rt7d6qL3urwhie0gTuackiaq95w3suv3pRZWlM3qcTP0XpNvz5+gAJSfcYrVAawzCh4An8BO4YhnH1arGa5pu7f4C7oPCqXo73X77fp3mE86+XwM2DD8ETuHs/ah9yfs6qGS550jW6i8E/Hd+/M443qd5hn6X59eO30krTIvcxrW7TosQNujlmxwyXrm/vb/wTH3xSILwqkpCdN3Z39UFxvgt9fPfzS05omES0mhbsS5twT1dnDrmHzA9WJN3Qm/kwyQp2TdiL65ds4ARlaZiw0sgNi6X2NxF4M7vJ0yJblTfLUvVaLKtbsdykKMsxjF/EXroAPVKSbl4ycL3/Vv0UYf+cI5omd5VKXiR+jC5smR4pw7HPCMAJ9AgGHJeke3DJ1W/czf/MLfvA0QATcmkc37pm/6XmhUnNgzSoUMwAh4sUZGGG1zAklcvhv0/qK9+DPmaABRiECWUw8TEY9qqVoWaYHa0rr4a9pw9/84ucAG5CQXkcj7Wa0GpXxWajev2sEcgwZbUYM8ghyGDtZosL0d9LHx1KcVwmKEgpKzNfrSjWZPLS4J7uPnx6v+d95j58ehXM57vS3Cwv4ZEWl8ATvH9lF/tBCu4MzFiYbK4n9LIMWAo+fHrj+nP1bNK4ZuELhWrl9q08ZYoZ92Lqwxsz/x2nfU3OZQ55ZYJeTp2lQB9ol2ToeBNShvO3uNiHLDjLVGoFzWsk9SE5RwL3FLwdFmCDGXd5xe0gKTD4n7JguFtpcyWgPnz6rTH0+apytRKiUv53xvJn8AvYPgMuB3dV46xnsDxMNnfgn5eEvJ7Aq2usq+sErpYFXrmp/5bk3R80Bn4B50PKY8Ct/2gAlfdYwvUHPMBxsGDpfxPWejgj6bFEWsmyAEwQ8HHOwnXol03jgreL0Blt1/kHup3XctWKByluNQCHAAd+/PFH8OHTF7f/z+Cf4MOn1wzo86vZ+YWXW9Mvg/r/g/O7pPZ3MfyGtr4F7eulu29JX1D5ksx3snZV4crklLn7yryfs3+D+dvRvCqPd/b2n4L1iiwZK8Oc6p2+/FRDeFdLdjEWEqFimB1TvlDuHcxrJPS+pt1fjKUi+xWClKU53OBfx1CR3d6BNHmRq1bCNfgL2OQ4K6F28/kZ1LI89WtxWiSM/lCiO6kA8D2QE1rkGMiSAUIK1gUhx5IYJthnGIF1mFNWrQCwTnNgDlVZB2ECPvHVap3nP/8AUHrmQeEaUAYZ+PBq8y8+yj8vxzA6f1+Hlx/xCcYZECoAoDTBlXMo3QD7UWlroRjnfz9ch2xIASQ5hugIYohwGc55j4c1XYXJOv2W2zha0+phTd+sV84hnP2pMHppJNyrPEOGAQrzMzs7lq7ikNKS41VKmyjMAfc2txdzHYTK6Xhm3GvKoHfuYueEl5qXk/3w6VUsn9+eUBkqwmtYEEYBD/g78AtgGAMOvjJaxlCafLupcwA6LuFoyJMwKQ4Xdn9gtPSd4xIp2E8TwOk7cMPfRa3E0qtsZzg/7zdNzqp+kO5LLbD6MlOPX715Jyk2zsN12UzhlTddERtSsM9DVrLhCgAsLfzgjXatmuXpLizDKMm5X0Kj3Mi5B/yu4Dr8j+kHf4RnvVftlwvUdfB10Lag7NdVlgJSMq+krHwIkjThSvKFYI5Alubsku+QAoIpBSSMMDmWSh6ufA+oD5MEozM6szz1MKpWvgfmtDf9WxzAI8LJ3x+BU/LlUsj3SxMlgPLQL7kGLX1e+DQrb6yA4B0mADJA07i0fx51/wBewcAel+X9VwYCuMMgZCAPNwEDSbqvVl4q6YztC/jQ9fOrxsjBLKzS1I8wq6JapayKP6+W7nCehwhX/TRZl2Py3J0LQsCPPwJ5qlR+Ms6iP1cm5+Qa5xvg09un9sN9q1IK/3qpQxDHacLlmKQQXe4dOIP5173lr2Ui45RhcLnqv5zy+SwucdLqK8sxpNGLlYvOv4Tb5bryjWvlTf7i6qp2zcLv6byTuK8qieO+q/xvAAAA//9eqS4amh4AAA==" -> "H4sIAAAAAAAA/9RZ6XLiSLb+T0S/Q467ImYmagSSWGzc7YlBILFKgFZE3w4ipUyQUGqxMsVWXe9+Qyxuu8rVy42JuDP+A1KeLU9+ec53TDdNGE4YZx4z/AjigrAwgzmrxeEBox+AlxYJgvnx6U4dqrI0tbReR3fvKuUTZ+OchmnyCIQq/13luwrHvRb6rnKz3QtpltKQnWUhY9APYpywH8A6JDiBMX66C5OQVf315u5XLTOHCV3jnJMTP0VhsnkE917IXgmcQ2b4wGo+SQvE+WmyDjffVdQwxl8F9/1rmUqloDinjxUAOFBG8AiwL3LlywoAAFAarGDBgjQPTxitInw8y5Z/HLijNOByCkGn0+lIde0Eu8LRF+XysdeZd6ROp9PtzLuH7VoZDkl/3U3aoU8Gx9jJZSk3LZFMWiwy+qaAs3vUnZ32wtZtOUkwJ7OFmuFZHmoHbUH6D74zbdd0JZMQf2ore+34MVpvgva6OGpuoz38qMLW9Gja0qYZaKlyWOuLfjMcML9mzEniyUo4zoyoQcIsbcyXTGLxpvO8iYxOq3cKjhuvVTTVdngwh4eGI20LQ+X7i/lJ22Z4fQyd4iMd6h8D0crn0bgjFcXQnXv5lnxUAjuGk12+O5pTsaBTtktcaRt4s/1xei86sy3MxqjWDkz4PJOFvXJsWYqYLPzGbLPnN+Hca9HQU8zTvWbig1NvztsPz9l86qju2M82y5wYcDAYLw01YKfpvYqW+XSiWIvUEDq4c2xsAuZr+VQyidc0drP7+unEP0u6IvrdaWPK77Pmfv88C3Z7MWFePTMnM4YwG320m/x8lmTJ4mgYyTITT8rex6LgLQ6t+yRokySY5MvNFt/76TyZdZRDzSf1lmyMjpuwmPnS/mMkPLgFcdWF9QwlFu1Hk0jf9rKtuRBxUx0JrbR3T0cDv1FzmtFxPdkhldoBeha6i0HftqfZKd14fLtpuyGvL5QsWeo1Adubbk3/6NhH5q7dBz5f21MfdVKxv1wno+bJ1a3FaNRWlxFMDoe6fG9Nw0geaW1qbUWeP7W6xyM/XA+fTW8kSM31/RrVoa/nk0bPdy2kDGuCdNScliJs7/1l2OlPR2PNOy0U3qyz9cOBx8L86QnEcJvm/8oxCiCr+ml89xbvGInNptA+Y757wTxZ9oaCZsrN8t1wJglbhTSylmJK4WFgtvbTqLV4SLa15T1OZ9pcrqn8ftx4aI5B6hUIhm+cVfZ5yPCqrAjXa5lBFjyCGouzy/VelTVitYM5PUfmX6rAI/jlGujUkKzhpLfqTlV1aD491H24fuB53BSbYsNrCI31/brprZsQ86jutwXRf2gLbfGq3Z2qs6kh6zf1+3UT11sItRsPQpNfQ7/h8fVWveW3UL3tefctLOIHAa2/dN5ZdWXdfJoYPJsYQle30MgMpZ5ujyzDWo7mvGLp5zWedSNhZFi6bMtab+4sF0teqRvWSFryxLZ62lwV3ZNmS30ragqeuORxrDbNXiTq/cDyRF1CvK47VjbxhGwEB8utGSm6bu3Hc6JIiF8+67atzSMymJuKrVtKHfGHUOWb2VJB1BeynrZYbj1Hqxv9YGtGwvN8gWa2bLdMW19iS5BtU1vAvjY1F5mE9lm51nizFikL0x7piLcTx9Idy1ZkXVZ4FKtHY6sEdj3IzT7fxHbWmvOaZPGkrivK0ojYzolIimJt2j3HPOpaliIvRaRYsiKfZZ12r3yeR4o2T6TcsRXXsDXVPQUTx8k0yyYJTiR9ammSKowmaoyGek86uAvlhLabsWuPtnakihpRm8soOOiWdYDWwXbkh7raG+l4a5+gmKVqPTuYAzKwtkHdIu5uImoj1Rke/K1kYzszXf4AVcGv23Z2nO9TXuvpsVtPT+aCNDxFa9mCvbQEKZlHZAL7SJoOFOaTzFCdduw6+hEPbMPsspMXLWXDYQ217ufuSRkvbbtQY42qCsq6xOad3migC8ueTpBmispuGem5o9g9PbEnxgCNLQf1zYF+MmQNOo4WI4IcQ8mgFjUaiEd7lSjQMYdN9xQI3kJ6Vu3O2JKX1JHVxrKvQFMWAkchoW5KmrHQHVXWhkYi1XWe7N2EFJ5NLK/LTnpii15P39l94YgH6Q4vgpYv66IdCTM/UkbePGt4Iq37xGb2wI70vq1YwqhrikhSLSa4lmDYAzswFpLunUaRV18exqfOQY/d09xqHG1LkxBvS3NHmdqy0NcXaGjZRO6SpaHK7e6cEEWP0vrSXLpqPdov+23qG+2xS5aZG5EMiXphCZ1ci4TuVEaSatuRsUC6Ywld11L6xhYRjWxO2JQiT9yPv6Er3XT1BVLmYbtuWUttbgndueM23r9XhxeMzjeZpCeZqImEGLzf9JRs4kfDo+kIEMrKwZCJip1DYNaJ45t+XT+RrmmPLD3R9k5i8epgWNcFve7yeorijaBb2s5QlLAbH3JkSq5mtd0lr4vOQOv6/XbfGIxEVWYzwzmYmmCP1YW71/p0ZxCSOAM/9/qZZQ/U3XSR7b1tYNjxgfkDa6fzwsw0rbHljAZWl03h1ob+yY51frmAcqNumkPBcpg97Y3G3iAgRqRQaxEM5+KhZ/XthhVpmmsqTW3Rqdv9ZjLtSRODIB7b0nw6z3hLRNo86dQ12zaWzgOvWVbDkrOjkXROcEB2mjJqTO2RrovsiB3NMBYonkeBCOuBZsTLwhfVumO0Rc0hgr4NGJaFVner8W6UNsd81tQtRTAG6cGNkOBbmjuuK2PL1i3UbeveyT2iCC1cK2pawnLiErXh2oE6P42mWqJsoTM6+FursdzqshHNx0aiUdN4qPsDrelvlZ220Hk3GhUaiYT5Qm13w0tN1q2mPJQ1xSL6SI9Ib27ryqWW8+MvO4VhTFZj2TVWHV17gnnyCPf0kWI/x4zGMIEbnD8WlMOQMk54bNfr901RaN+32+2r1CM+MJwnkKz8NM5SivMz0+Q2TZnfmFd3hiUZXX04M4dTbaV2tE7/2qQ6Wu//7pkWHvXzMCs5OXdV4fw0jmGCuGjukrR98+8apqyuBlPD1DqqvJrpsjJcPFEGN2Gy4W5b4G5b+DJLvaH+VMPMr6XUK0KCvhQ05K4um8bL1mStN5sONXNl6ZOngLGMPtZqb/dWfdlbFcbwlCZwT0sWUXvNG95z+dWLKktj8j6d+ClKt+HP1wdISLrHaIXSGIYJBU/gJ3DHMIyrV4vVNN/c/QPcBYVX9XK8//L9Ps0jnH+9BG4efAiewN37UfuQ83NWzXDJk67RXQz+6fj+nXG8SfUO+yzNrx+/lVaaFrmPaXWbFiVu0M0xO2a4dH17f+Of+OCTAuFVkYTsvLG7qw+K813o47ufX3JCwySi1bRgX9qEe7o6c8g9ZH6wIumG3syHSVawa8JeXL9kAycoS8OElUZuWCy1v4nAm9lNnhbZqpwsS9XrZVndLstNirIcw/hF7KUK0CMl6eYlA9f5t+qnCPvnHNE0uatU8iLxY3Rhy/RIGY59RgBOoEcw4Lgk3YNLrn5jNv8zU/aBowEm5FI4vjVm/6XmhUnNgzSoUMwAh4sUZGGG1zAklcvhv0/qK9+DPmaABRiECWUw8TEY9qqVoWaYHa0rr4a9pw9/84ucAG5CQXkcj7Wa0GpXxWajev2sEcgwZbUYM8ghyGDtZosL0d9LHx1KcVwmKEgpKzNfrSjWZPJS4J7uPnx6v+Z95j58ehXM57vS3Cwv4ZEWl8ATvH9lF/tBCu4MzFiYbK4n9LIMWAo+fHrj+nP1bNK4ZuELhWrl9q08ZYoZ92Lqwxsz/x2nfU3OpQ95ZYJeTp2lQB9ol2ToeBNShvO3uNiHLDjLVGoFzWsk9SE5RwL3FLxtFmCDGXd5xe0gKTD4n/LCcLerzZWA+vDpt9rQ56vK1UqISvnfacufwS9g+wy4HNxVjbOewfIw2dyBf14S8roDr66xrq4duFpe8MpN/bck7/6gMfALOB9SHgNu/UcDqLzHEq7/wAMcBwuW/jdhrYczkh5LpJUsC8AEAR/nLFyHflk0Lni7CJ3Rdu1/oNt5LVeteJDiVgNwCHDgxx9/BB8+fTH9fwb/BB8+vWZAn1/1zi+83Ip+GdT/H5zfJbW/i+E3tPUtaF8v3X1L+oLKl2S+k7WrClcmp8zdV+b9nP0bzN+O5tX1eGdv/ylYr8iSsTLMqd7py081hHe1ZBdjIREqhtkx5Qvl3sG8RkLva9r9RVsqsl8hSFmaww3+tQ0V2e0dSJMXuWolXIO/gE2OsxJqN5+fQS3LU78Wp0XC6A8lupMKAN8DOaFFjoEsGSCkYF0QciyJYYJ9hhFYhzll1QoA6zQH5lCVdRAm4BNfrdZ5/vMPAKVnHhSuAWWQgQ+vNv/io/zzcgyj8/d1ePknPsE4A0IFAJQmuHIOpRtgPyptLRTj/PPDtcmGFECSY4iOIIYIl+Gc93hY01WYrNNvuY2jNa0e1vTNeuUcwtmfCqOXQsK9yjNkGKAwP7OzY+kqDiktOV6ltInCHHBvc3sx10Go7I5nxr2mDHrnKnZOeKl5OdkPn17F8vntCZWhIryGBWEU8IC/A78AhjHg4CujZQylybebOgeg4xKOhjwJk+JwYfcHRkvfOS6Rgv00AZy+Azf8XdRKLL3Kdobz837T5KzqB+m+1AKrLzP1+NWbd5Ji4zxcl8UUXnnTFbEhBfs8ZCUbrgDA0sIP3mjXqlme7sIyjJKc+yU0yo2ca8DvCq7D/5h68Ed41nu3/TJAXRtfB20Lyn5dZSkgJfNKypsPQZImXEm+EMwRyNKcXfIdUkAwpYCEESbHUsnDle8B9WGSYHRGZ5anHkbVyvfAnPamf4sDeEQ4+fsjcEq+XAr5fmmiBFAe+iXXoKXPC59m5cQKCN5hAiADNI1L++dW9w/gFQzscXm9/8pAAHcYhAzk4SZgIEn31crLTTpj+wI+dP38qjByMAurNPUjzKqoVilvxZ9XS3c4z0OEq36arMs2ea7OBSHgxx+BPFUqPxln0Z8rk3NyjfME+PT2qf1w36qUwr8OdQjiOE24HJMUosvcgTOYf11b/lomMk4ZBpdR/+WUz2dxiZNWX1mOIY1erFx0/iXchuvKN8bKm/zF1VXtmoXf03knceWGtHR/gRTe4fzIgvNEQMHl99oix+gfAF/6SJwm4Rl55y9pyUheKVW/5f8s/dWd5bjvKv8bAAD//4Lm6pwEHwAA" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-03d78cef41dc18798" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0f2a613e34ee8496a" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0f2a613e34ee8496a" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9RZaXPqyLn+TtX8h47nVCWpE4EWwMYzTgWBxCphtCJyU1RL3SCh1nLULbYz57/fEovHPsez3UrVTfwFS/1u/fTT7wK9LGU4ZZx1zPEjSErCohwWrJFEB4x+AH5WpggWx6c7baQp8szW+13Du6tVT5yDCxpl6SMQ6vx3te9qHPda6LvazXY/onlGI3aWhYzBIExwyn4A64jgFCb46S5KI1YP1pu7n7WsAqZ0jQtOSYMMRenmEdz7EXslcA6Z4QNrBCQrERdk6TrafFfTogR/E9z3r2VqtZLigj7WAOBAFcEjwIHIVS9rAABAabiCJQuzIjphtIrx8Sxb/XHgjtKQKygE3W63K0v6CfaEYyAq1WO/O+/K3W631533Dtu1OhqRwbqXdqKADI+JWyhyYdkimbZZbA4sAef3qPd82gtbr+2m4Zw8L7QcPxeRftAXZPAQuLNOw1BzGfGnjrrXjx/j9SbsrMuj7jU7o48abM+OliNvWqGeqYe1sRi0oiELGuacpL6iRpPcjJskyrPmfMlklmy6nzax2W33T+Fx47fLltaJDtbo0HTlbWlq/GAxP+nbHK+PkVt+pCPjYyjaxTyedOWyHHlzv9iSj2roJHC6K3ZHayaWdMZ2qSdvQ/95f5zdi+7zFuYT1OiEFvz0rAh79di2VTFdBM3nzZ7fRHO/TSNftU73uoUPrtSadx4+5fOZq3mTIN8sC2LC4XCyNLWQnWb3GloWs6lqLzJT6OLusbkJWaAXM9kifsvcPd9LpxP/STZUMejNmjN+n7f2+0/P4W4vpsyXcmv6zBBm449Oi58/p3m6OJpmuszFk7oPsCj4i0P7Pg07JA2nxXKzxfdBNk+fu+qhERCprZjj4yYqnwN5/zEWHrySeNrC/gRlFu/H09jY9vOttRBxSxsL7ax/T8fDoNlwW/FxPd0hjToh+iT0FsOB48zyU7bx+U7L8SLeWKh5ujQaAnY2vYbx0XWOzFt7D3yxdmYB6mbiYLlOx62TZ9iL8bijLWOYHg6Scm/PolgZ6x1qb0WeP7V7xyM/Wo8+Wf5YkFvr+zWSYGAU02Y/8GykjhqCfNTdtips74Nl1B3MxhPdPy1U3pLY+uHAY2H+9AQSuM2KfxQYhZDVgyy5e8t3jMRWS+icOd+7cJ4s+yNBt5RW9W70LAtblTTztmrJ0WFotfezuL14SLeN5T3OnvW50tD4/aT50JqAzC8RjN44q+2LiOFVlRGu1zKHLHwEDZbkl+u9qnLEagcLeo4suGSBR/DTNdCZKdujaX/Vm2nayHp6kAK4fuB53BJbYtNvCs31/brlr1sQ80gKOoIYPHSEjnjV7s2055mpGDf1+3ULS22EOs0HocWvYdD0eakttYM2kjq+f9/GIn4Q0Ppr591VTzGsp6nJs6kp9Awbja1I7hvO2Dbt5XjOq7ZxXuNZLxbGpm0ojqL35+5yseRVybTH8pInjt3X55ronXRHHthxS/DFJY8TrWX1Y9EYhLYvGjLiDcO186kv5GM4XG6tWDUMez+ZE1VG/PKT4Tj6PCbDuaU6hq1KiD9EGt/KlyqigZD39cVy67u6ZA7CrRULn+YL9OwoTttyjCW2BcWx9AUc6DNrkcton1drzTdrsbqwnLGBeCd1bcO1HVUxFJVHiXY0t2roSGFhDfgWdvL2nNdlmyeSoapLM2Y7NyYZSvRZ7xzzuGfbqrIUkWorqnKWdTv96nkeq/o8lQvXUT3T0TXvFE5dN9dth6Q4lY2ZrcuaMJ5qCRoZffngLdQT2m4mnjPeOrEm6kRrLePwYNj2AdoHx1UeJK0/NvDWOUExzzQpP1hDMrS3oWQTbzcV9bHmjg7BVnawk1sef4CaEEiOkx/n+4zX+0biSdnJWpCmr+ptR3CWtiCn85hM4QDJs6HKApKbmttJPNc44qFjWj128uOlYrqsqUlB4Z3UydJxSi3RqaaivEcc3u2Ph4aw7BsE6Zao7paxUbiq0zdSZ2oO0cR20cAaGidT0aHr6gkiyDXVHOpxs4l4tNeICl1r1PJOoeAv5E+a053YypK6itZcDlRoKULoqiQyLFk3F4arKfrITGXJ4MneS0npO8T2e+xkpI7o942dMxCOeJjt8CJsB4ohOrHwHMTq2J/nTV+kUkAc5gyd2Bg4qi2Me5aIZM1mgmcLpjN0QnMhG/5pHPvS8jA5dQ9G4p3mdvPo2LqMeEeeu+rMUYSBsUAj2yFKjyxNTen05oSoRpxJS2vpaVK8Xw46NDA7E48scy8mORKN0ha6hR4LvZmCZM1xYnOBDNcWep6tDswtIjrZnLAlx764n/yCrnzTNRZInUcdybaX+twWenPXa75/rw4vHJ1vctlIc1EXCTH5oOWr+TSIR0fLFSBU1IOpEA27h9CSiBtYgWScSM9yxraR6ns3tXltOJIMwZA83shQshEMW9+Zqhr1kkOBLNnT7Y635A3RHeq9YNAZmMOxqCns2XQPli44E23h7fUB3ZmEpO4wKPxBbjtDbTdb5Ht/G5pOcmDB0N4ZvPBsWfbEdsdDu8dmcOvA4OQkBr9cQKUpWdZIsF3mzPrjiT8MiRmr1F6Eo7l46NsDp2nHuu5ZaktfdCVn0EpnfXlqEsRjR57P5jlvi0ifp11Jdxxz6T7wum03bSU/mmn3BIdkp6vj5swZG4bIjtjVTXOBknkcilAKdTNZloGoSa7ZEXWXCMY2ZFgR2r2tzntx1prwecuwVcEcZgcvRkJg695EUie2Y9io1zH8k3dEMVp4dtyyheXUI1rTc0JtfhrP9FTdQnd8CLZ2c7k1FDOeT8xUp5b5IAVDvRVs1Z2+MHgvHpc6iYX5Quv0oktONuyWMlJ01SbG2IhJf+4Y6iWX85OvK4VpTlcTxTNXXUN/gkX6CPf0keKgwIwmMIUbXDyWlMOQMk547EjSfUsUOvedTucq9RilDBcpJKsgS/KM4uLcaXI02xXN+OrOtGWzZ4yerdFMX2ldvTu4Fqmu3v+/e6alT4MiyquenLuqcEGWJDBFXDz3SNa5+fdMS9FWw5lp6V1NWT0bijpaPFEGN1G64W5b4G5b+Bql/sh4amAWNDLqlxFBXwuaSs9QLPNla4ref56NdGtlG9OnkLGcPjYauzzAHI8ESWg1Jb7danZ8IUBc53Qo7k+tXf3t3usve69XinWYwFOWwj2tWo3G6+bivbi+eVFnWULe7zn+GWfb6F/XB0hItsdohbIERikFT+Cf4I5hmNSvFutZsbn7G7gLS7/uF3j/9ft9VsS4+HYJ3DwEEDyBu/ejDiAXFKye46qZukZ3MfiH4/t3xvEG6h0OWFZcP34NVpqVRYBpfZuVFbnQzTE75rhyfXt/a1LxISAlwqsyjdh5Y3dXHxQXuyjAd/96wYRGaUzrWcm+tgn3dHVuNPeQBeGKZBt6Mx+lecmugL24fkEDpyjPopRVRt4SVsC8JPiwxUsS9PmgxeFPu0122In1yvqv0/Tme1NkZb6qZtTK/vXarW7X7iZFWYFh8iL2kk/okZJs8wLTdZKuBxnCwRlImqV3tVpRpkGCLn03PVKGk4ARgFPoEww4Ls324ALor0z5f2ReP3A0xIRcUtAvDex/avhR2vAhDWsUM8DhMgN5lOM1jEjtwpD3x4Pa92CAGWAhBlFKGUwDDEb9em2km1ZX7ymrUf/pw1+CsiCAm1JQndljoyG0O3Wx1axfPxsEMkxZI8EMcggy2LjZ4iL018pHl1KcVACFGWUV8vWaak+nL6ny6e7D5/ez5xfuw+dXwXy5q8w9FxWHsvISeIr3r+ziIMzAnYkZi9LN9YRelgHLwIfPb1x/qZ9NmlcUvlKo127/VadMMeNeTH14Y+a/47Sv4Fwqml8B9HLqLAPGUL+AYeBNRBku3vJiH7HwLFNrlLRokCyA5BwJ3FPwtqyADWbc5RW3g6TE4H+qC8Pd7j9XEerD518raF+uKlcrEarkf6PAfwE/ge0nwBXgrm6e9UxWROnmDvz9AsjrWr66xrq61vJ6dcFrN/Vfk7z7ncbAT+B8SEUCuPXvDaD2Xr9x/SoQcBwsWfbfxLU+zkl2rJhW9WsApggEuGDROgqqpHHh20XozLZrkQS97mu5es2HFLebgEOAAz/++CP48Pmr7xG+gL+DD59f91JfXhXYr7zckn4V1P8fnd9tj3+Tw28a4Lekfb1090vSF1a+gPkOalcVrgKnwu4b80HB/g3mb0fz6nq8s7f/FK7XFNlcmdbM6A6UpwbCu0a6S7CQCjXT6lrKpXnfwaJBIv/bBv6rslTmP1OQsqyAG/xzGSrz2zuQpS9y9Vq0Bn8CmwLnFdVuPr+ARl5kQSPJypTRHyp2pzUAvgdKSssCA0U2QUTBuiTkWHWPKQ4YRmAdFZTVawCsswJYI00xQJSCz3y9LvH8lx8Ays59ULQGlEEGPrza/IuP6s8vMLyMX+vo8nMAwTgHQg0AlKW4dg6lF+IgrmwtVPP8Q8a1yEYUQFJgiI4ggQhX4Zz3eFjTVZSus19ym8RrWj+s6Zv12jmEsz8Nxi+JhHuFM2QYoKg4d2fHylUSUVr1eLXKJooKwL3F9mKui1BVHc9t+Zoy6J+z2BnwSvNysh8+v4rly9sTqkJFeA1LwijgAX8HfgIMY8DBV0arGCqTbzd1DsDAFR1NZRql5eEyAhwYrXwXuGIKDrIUcMYO3Ph3Uau49ArtHBfn/WbpWTUIs32lBVZfI/X4zZt3QHFwEa2rZAqvfdOVsREF+yJiVTdcA4BlZRC+0W7U8yLbRVUYVXMeVNSoNnLOAb8puI7+Y/LB7+mz3rvtlynrWvi6aFtS9vMqywCpOq+0uvkQpFnKVc0XggUCeVawC94RBQRTCkgUY3KslHxc+x7QAKYpRmd25kXmY1SvfQ+sWX/2lySER4TTvz4Ct+qXK6EgqExUBCqioOo1aOXz0k+zaqwFBO8wAZABmiWV/XOp+xvwSwb2uLref2YghDsMIgaKaBMykGb7eu3lJp25fSEfun5+kxg5mEd1mgUxZnXUqFW34o+rZTtcFBHC9SBL11WZPGfnkhDw449Amam1f5pn0X/VpmdwzfME+PT2qfNw365Vwj8PdQjiJEu5ApMMosvcgXNYfJtb/lwBmWQMg8v3AS+nfD6LS5y0/spyAmn8YuWi8w/hNoHXfmGsvMlfXF3Vrij8ls47wH1zkzjuu9r/BgAA//98XG2M5B4AAA==" -> "H4sIAAAAAAAA/9RZ6XLiSLb+T0S/Q467ImYmagQSAmzc7YlBILFKgFZE3w4ipUyQUGqxMsVWXe9+Qyxuu8rVy42JuDP+g6U8W5788pzvQDdNGE4YZx4z/AjigrAwgzmrxeEBox+AlxYJgvnx6U4dqrI0tbReR3fvKuUTZ+OchmnyCIQq/13luwrHvRb6rnKz3QtpltKQnWUhY9APYpywH8A6JDiBMX66C5OQVf315u5XLTOHCV3jnJMTP0VhsnkE917IXgmcQ2b4wGo+SQvE+WmyDjffVdQwxl8F9/1rmUqloDinjxUAOFBG8AiwX+fKlxUAAKA0WMGCBWkenjBaRfh4li3/OHBHacDlFIJOp9ORRO0Eu8LRr8vlY68z70idTqfbmXcP27UyHJL+upu0Q58MjrGTy1JuWnUyabHI6JsCzu5Rd3baC1u35STBnMwWaoZneagdtAXpP/jOtF3TlUxC/Kmt7LXjx2i9Cdrr4qi5jfbwowpb06NpS5tmoKXKYa0v+s1wwPyaMSeJJyvhODOiBgmztDFfMonFm87zJjI6rd4pOG68VtFU2+HBHB4ajrQtDJXvL+YnbZvh9TF0io90qH8M6lY+j8YdqSiG7tzLt+SjEtgxnOzy3dGc1gs6ZbvElbaBN9sfp/d1Z7aF2RjV2oEJn2eysFeOLUupJwu/Mdvs+U0491o09BTzdK+Z+OCIzXn74TmbTx3VHfvZZpkTAw4G46WhBuw0vVfRMp9OFGuRGkIHd46NTcB8LZ9KJvGaxm52L55O/LOkK3W/O21M+X3W3O+fZ8FuX0+YJ2bmZMYQZqOPdpOfz5IsWRwNI1lm9ZOy93Fd8BaH1n0StEkSTPLlZovv/XSezDrKoeYTsSUbo+MmLGa+tP8YCQ9uQVx1YT1DiUX70STSt71say7quKmOhFbau6ejgd+oOc3ouJ7skErtAD0L3cWgb9vT7JRuPL7dtN2Q1xdKliz1moDtTbemf3TsI3PX7gOfr+2pjzppvb9cJ6PmydWtxWjUVpcRTA4HUb63pmEkj7Q2tbZ1nj+1uscjP1wPn01vJEjN9f0aidDX80mj57sWUoY1QTpqTksRtvf+Muz0p6Ox5p0WCm+KbP1w4LEwf3oCMdym+b9yjALIqn4a373FO0b1ZlNonzHfvWCeLHtDQTPlZvluOJOErUIaWUsxpfAwMFv7adRaPCTb2vIepzNtLtdUfj9uPDTHIPUKBMM3zir7PGR4VVaE67XMIAseQY3F2eV6r8oasdrBnJ4j8y9V4BH8cg10akjWcNJbdaeqOjSfHkQfrh94HjfrzXrDawiN9f266a2bEPNI9NtC3X9oC+36Vbs7VWdTQ9Zv6vfrJhZbCLUbD0KTX0O/4fFiS2z5LSS2Pe++hev4QUDrL513Vl1ZN58mBs8mhtDVLTQyQ6mn2yPLsJajOa9Y+nmNZ91IGBmWLtuy1ps7y8WSV0TDGklLnthWT5urdfek2VLfipqCV1/yOFabZi+q6/3A8uq6hHhdd6xs4gnZCA6WWzNSdN3aj+dEkRC/fNZtW5tHZDA3FVu3FBHxh1Dlm9lSQdQXsp62WG49RxONfrA1I+F5vkAzW7Zbpq0vsSXItqktYF+bmotMQvusXGu8WYuUhWmPdMTbiWPpjmUrsi4rPIrVo7FVAlsMcrPPN7Gdtea8Jlk8EXVFWRoR2zkRSVGsTbvnmEddy1LkZR0plqzIZ1mn3Suf55GizRMpd2zFNWxNdU/BxHEyzbJJghNJn1qapAqjiRqjod6TDu5COaHtZuzao60dqXWNqM1lFBx0yzpA62A78oOo9kY63tonWM9SVcwO5oAMrG0gWsTdTeraSHWGB38r2djOTJc/QFXwRdvOjvN9yms9PXbF9GQuSMNTtJYt2EtLkJJ5RCawj6TpQGE+yQzVaceuox/xwDbMLjt50VI2HNZQRT93T8p4aduFGmtUVVDWJTbv9EYDXVj2dII0s67slpGeO4rd0xN7YgzQ2HJQ3xzoJ0PWoONoMSLIMZQMalGjgXi0V4kCHXPYdE+B4C2kZ9XujC15SR1ZbSz7CjRlIXAUEuqmpBkL3VFlbWgkkqjzZO8mpPBsYnlddtITu+719J3dF454kO7wImj5sl63I2HmR8rIm2cNr05Fn9jMHtiR3rcVSxh1zTqSVIsJriUY9sAOjIWke6dR5InLw/jUOeixe5pbjaNtaRLibWnuKFNbFvr6Ag0tm8hdsjRUud2dE6LoUSouzaWritF+2W9T32iPXbLM3IhkqK4XltDJtUjoTmUkqbYdGQukO5bQdS2lb2wR0cjmhE0p8ur78Td0pZuuvkDKPGyLlrXU5pbQnTtu4/17dXjB6HyTSXqS1bU6IQbvNz0lm/jR8Gg6AoSycjBkomLnEJgicXzTF/UT6Zr2yNITbe8kFq8OhqIu6KLL6ymKN4JuaTtDUcJufMiRKbma1XaXvF53BlrX77f7xmBUV2U2M5yDqQn2WF24e61PdwYhiTPwc6+fWfZA3U0X2d7bBoYdH5g/sHY6L8xM0xpbzmhgddkUbm3on+xY55cLKDdE0xwKlsPsaW809gYBMSKFWotgOK8felbfbliRprmm0tQWHdHuN5NpT5oYBPHYlubTecZbdaTNk46o2baxdB54zbIalpwdjaRzggOy05RRY2qPdL3OjtjRDGOB4nkU1KEYaEa8LPy6KjpGu645RNC3AcOy0OpuNd6N0uaYz5q6pQjGID24ERJ8S3PHojK2bN1C3bbundwjitDCtaKmJSwnLlEbrh2o89NoqiXKFjqjg7+1GsutLhvRfGwkGjWNB9EfaE1/q+y0hc670ajQSCTMF2q7G15qsm415aGsKRbRR3pEenNbVy61nB9/2SkMY7Iay66x6ujaE8yTR7injxT7OWY0hgnc4PyxoByGlHHCY1sU75t1oX3fbrevUo9hwnCeQLLy0zhLKc7PTJOj6S5vRFd3hiUZXX04M4dTbaV2tE7/2qQ6Wu//7pkWHvXzMCs5OXdV4fw0jmGCuGjukrR98+8apqyuBlPD1DqqvJrpsjJcPFEGN2Gy4W5b4G5b+DJLvaH+VMPMr6XUK0KCvhQ05K4um8bL1mStN5sONXNl6ZOngLGMPtZqu8zHHI8EUWg2RL7VbLQ9wUdc+3TI70/NXfXt3qsve6+WilUYw1OawD0tqUbtNbl4L66vXlRZGpP3OcdPUboNf74+QELSPUYrlMYwTCh4Aj+BO4ZhXL1arKb55u4f4C4ovKqX4/2X7/dpHuH86yVw8+BD8ATu3o/ah5yfs2qGSzJ1je5i8E/H9++M402qd9hnaX79+K200rTIfUyr27QowYVujtkxw6Xr2/sbScUHnxQIr4okZOeN3V19UJzvQh/f/fySExomEa2mBfvSJtzT1Zlo7iHzgxVJN/RmPkyygl0T9uL6JRs4QVkaJqw08hawAuZFwYNNXhShx/tNDj/vNulhV6+W1n8bpjffmzwtslU5o5b2r9dudbt2NynKcgzjF7GXekKPlKSblzRdJ+mqnyLsnxNJ0+SuUsmLxI/RhXfTI2U49hkBOIEewYDjknQPLgn9jSn/z8zrB44GmJBLCfrWwP6XmhcmNQ/SoEIxAxwuUpCFGV7DkFQuCHl/PKh8D/qYARZgECaUwcTHYNirVoaaYXa0rrwa9p4+/M0vcgK4CQXlmT3WakKrXa03G9XrZ41AhimrxZhBDkEGazdbXIj+XvroUIrjMkFBSlmZ+WpFsSaTl1L5dPfh0/vV8zP34dOrYD7fleZmeYmhtLgEnuD9K7vYD1JwZ2DGwmRzPaGXZcBS8OHTG9efq2eTxjULXyhUK7f/ylOmmHEvpj68MfPfcdrX5Fw6mlcm6OXUWQr0gXZJho43IWU4f4uLfciCs0ylVtC8RlIfknMkcE/B27YCNphxl1fcDpICg/8pLwx3u/9cCagPn36roX2+qlythKiU/50G/xn8ArbPgMvBXdU46xksD5PNHfjnJSGve/nqGuvq2sur5QWv3NR/S/LuDxoDv4DzIeUx4NZ/NIDKe3zj+lUg4DhYsPS/CWs9nJH0WCKt5GsAJgj4OGfhOvTLonHB20XojLZrkwTdzmu5asWDFLcagEOAAz/++CP48OmL7xE+g3+CD59ec6nPrxrsF15uRb8M6v8Pzu/S49/F8BsC/Ba0r5fuviV9QeVLMt/J2lWFK5NT5u4r837O/g3mb0fz6nq8s7f/FKxXZMlYGeZU7/TlpxrCu1qyi7GQCBXD7JjyhbzvYF4jofc1gf+iLRXZrxCkLM3hBv/ahors9g6kyYtctRKuwV/AJsdZCbWbz8+gluWpX4vTImH0hxLdSQWA74Gc0CLHQJYMEFKwLgg5luwxwT7DCKzDnLJqBYB1mgNzqMo6CBPwia9WRZ7//ANA6ZkHhWtAGWTgw6vNv/go/7wcw8v4tQ4vPwcQjDMgVABAaYIr51C6Afaj0tZCMc4/ZFybbEgBJDmG6AhiiHAZznmPhzVdhck6/ZbbOFrT6mFN36xXziGc/akweikk3Ks8Q4YBCvMzOzuWruKQ0pLjVUqbKMwB9za3F3MdhMrueKbla8qgd65i54SXmpeT/fDpVSyf355QGSrCa1gQRgEP+DvwC2AYAw6+MlrGUJp8u6lzADou4WjIkzApDpcR4MBo6TvHJVKwnyaA03fghr+LWomlV9nOcH7eb5qcVf0g3ZdaYPVlph6/evNOUmych+uymMIrb7oiNqRgn4esZMMVAFha+MEb7Vo1y9NdWIZRknO/hEa5kXMN+F3BdfgfUw/+CM9677Zfpqxr4+ugbUHZr6ssBaRkXkl58yFI0oQryReCOQJZmrNLvkMKCKYUkDDC5FgqebjyPaA+TBKMzujM8tTDqFr5HpjT3vRvcQCPCCd/fwROyZdLId8vTZQAykO/5Bq09Hnh06wcawHBO0wAZICmcWn/3Or+AbyCgT0ur/dfGQjgDoOQgTzcBAwk6b5aeblJZ2xfwIeun18VRg5mYZWmfoRZFdUq5a3482rpDud5iHDVT5N12SbP1bkgBPz4I5CnSuUn4yz6c2VyTq5xngCf3j61H+5blVL416EOQRynCZdjkkJ0mTtwBvOva8tfy0TGKcPg8n3Ayymfz+ISJ62+shxDGr1Yuej8S7hN4JVvjJU3+Yurq9o1C7+n807iyg1p6f4CKbzD+ZEF54mAgssvv0WO0T8AvvSROE3CM/LO/6QlI3mlVP2W/7P0V3eW476r/G8AAAD//4z7fuhOHwAA" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0be5fe62c746161d6" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 15 -> (known after apply)
        id                      = "lt-0195b4ef20679c780"
      ~ latest_version          = 15 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R4a4+rOLb290j9H3jTW3pntA8JlyRVqelqTUggV0gwGAJzRpEBJxAcoMDktnv/9yNyqaldu3bPjOZIR11fUrbXzY+f5bVMP00oTihrnjL8xOxKQqMM5bS5i444+AvjpWUSoPz0XFfHqizNoTboAadeq0ashfMiSpMnhm9wP9V+qrHsW6Gfanfbg6jI0iKiF1lEKfLDHU7oX5h1RHCCdvi5HiURbfjrTf0fWmaOkmKNc1ZO/DSIks0T8+BF9I3AJWSKj7Tpk7QMWD9N1tHmp5oa7fB3wf38VqZWKwucF081hmGZKoInBvsCW03WGIZhiiJcoZKGaR6dcbCK8ekiW/2xTL0oQjYvENPr9XqSqJ1Rnz/5glwNBz29J/V6vX5P7x+3a2U8JsN1P+lGPhmddnYuS7kJBTLr0NgYmjzOHoL+4nzgt07HTkKdLJZqhhd5pB21JRk++va82wRKJgXcuasctNPneL0Ju+vypDmt7vizijrzk2lJm3aopcpxDZbDdjSiftPQSeLJSjTNjLhFoixt6S6V6G7Te9nERq8zOIenjdcp22o3OprjY8uWtqWhcsOlfta2GV6fIrv8XIzB51CAuR5Pe1JZjh3dy7fksxJaOzTb5/uTORfKYk73iSNtQ29xOM0fBHuxRdk0aHZDE70sZP6gnDpQEZKl31psDtwm0r1OEXmKeX7QTHy0xbbefXzJ9LmtOlM/27g5MdBoNHUNNaTn+YMauPl8psBlavA93Du1NiH1tXwumcRrG/vFg3g+cy8SUAS/P2/NuUPWPhxeFuH+ICTUEzNztqABppPPVpvTF0mWLE+GkbiZcFYOPhZ4b3nsPCRhlyThLHc3W/zgp3qy6CnHpk/EjmxMTpuoXPjS4XPMPzolcdQlfEESjQ+TWQy2g2xrLgXcVid8Jx08FJOR32ra7fi0nu0DtbDC4IXvL0dDy5pn53Tjcd225UQcWCpZ4oImj61Nvwk+29aJOmvnkcvX1twPeqkwdNfJpH12AFxOJl3VjVFyPIryA5xHsTzRugXcChx37vRPJ268Hr+Y3oSX2uuHdSAiH+Sz1sB3YKCMm7x00uyOwm8ffDfqDeeTqeadlwpninT9eOQwrz8/Mzu0TfO/5jgIEW346a7+Ld9xILTbfPfC+f6V88QdjHnNlNvV3Hgh8VuFtLKOYkrRcWR2DvO4s3xMtk33AacLTZebKneYth7bUyb1ygBF3zirHfKI4lV1I9zSMkM0fGKadJdd03tV3RGrPcqLS2T+9RZ4Yn67BTo3JDieDVb9uaqOzedH0UfrR47DbaEttLwW31o/rNveuo0wF4h+lxf8xy7fFW7a/bm6mBsyuKs/rNtY7ARBt/XIt7k18lseJ3bEjt8JxK7nPXSwgB/5YP3eeW/Vl4H5PDM4OjP4PoDBxIykAbAm0IDuROcUCC5rHO3H/MSAQLZkbaDb7tLlFNGAE8nliAUHmq4KzlmzpCGM27wnuBzeqW1zEAtgGEJPAFLAAWDDbObx2QSN3K0ZKwDAw1QnihRw7guwLE2PyUg3FQtARQy4Y6Ry7cxVgsLns4G2dLeerYnGMNyaMf+iL4OFJVsd0wIuhrxsmdoSDbW5ucyk4JBVa61v1mJlaVoTEHBWYkNgQ0uRgaxwwU49GVsltMQwN4dcG1tZR+c0CXJEBIriGjHd2zFJg502719invQhVGRXCBQoK/JF1u4OqrEeK5qeSLltKY5haapzDme2nWnQIglOJDCHmqTyk5m6C8ZgIB2dpXIOtpupY022VqwKGlHbbhweAYRHBI+WLT+K6mAC8NY6IyFLVTE7miMygttQhMTZzwRtotrjo7+VLGxlpsMdkcr7omVlJ/2QctoA7BwxPZtL0vIUrWPxlgt5KdFjMkPDQJqPFOqTzFDt7s6xwQmPLMPs07MXu7Jh05Yq+rlzVqauZZXqTitUJcj6xOLswWQEeHcASKCZgrJ3Y5DbijUAiTUzRsEU2sHQHIGzIWvItrVdQALbUDKkxa1WwAUHlSjINsdt5xzy3lJ6Ua3eFMpuYctqyx0qyJT50FZIBExJM5bAVmVtbCSSCDhycBJSehaBXp+eQWIJ3gDsrSF/wqN0j5dhx5eBYMX8wo+ViadnLU8oRJ9Y1BpZMRhaCuQnfVMIJBVS3oG8YY2s0FhKwDtPYk90j9Nz7wh2zlmHrZMFNSngLEm3lbkl80OwDMbQInKfuIYqd/s6IQqIU9E1XUcV44M77Ba+0Z06xM2cmGSBAErI93It5vtzOZBUy4qNZQBsyPcdqAyNbUA0sjljU4o94TD9ga501wXLQNGjrgihq+mQ7+u20/o4r46vHNU3mQSSTNAEQgzOb3tKNvPj8cm0eYRk5WjIRMX2MTRFYvumL4Iz6ZvWBIJEO9gJ5NTRWAQ8EB0OpMFuwwOo7Q1Fifq7Yx6YkqPBruNyQLBHWt8fdofGaCKoMl0Y9tHUeGuqLp2DNiz2BiGJPfJzb5hBa6Tu58vs4G1Dw9odqT+Ce8DxC9OEU2hPRrBP52hrIf9s7QDnLpHcEk1zzEObWvPBZOqNQmLESgGX4VgXjgM4tFow1jTHVNrasidaw3YyH0gzgwQctiR9rmccFAJNT3qiZlmGaz9yGoQtKGcnI+md0YjsNWXSmlsTAAR6wrZmGMtgp8ehgMRQM3Zu6QuqaBtdQbMJD7YhxTLf6W81zonT9pTL2gAqvDFKj04c8D7UnKmoTKEFYNDvAu/snII4WDowbkPenTlEbTlWqOrnyVxLlC2yJ0d/C1vuFshGrE+NRCtM41H0R1rb3yp7bQk4J56UGol5fal2+9H1TgawLY9lTYEETEBMBroFlOtdzk3fV4rR3DCf8ZHiPEGkUVC0iZJNVc2ytMB5Iy28MiJBI8037zV7gwGQDeOZfxAaIt/otBo8f5Ox52Aqg5VhzFZT2TFWPaA9ozx5QofiqcB+jmmxQwna4PypLFiMCsryT11RfGgLfPeh2+3epJ4KnO8jH196V3YsDEU7vbkwoGT0wXhhjufaSu1pveGt7PW0wX/gr/QKP4+yqstnbyqsn+52KAnYWHdI2r37dwxTVi/waT1VXi2ArIyXzzcA2Tui7CHN41s//ga7wRg8NzH1mzd82Tvgd+tyH8im8boxWRss5mPNXEEwew4pzYqnZvPbnTVed9ZAO3ROE3QoqnNsvu1DPnL53USDpjvycXvytzjdRn+/DRAh6QEHqyDdoSgpmGfmb0ydYrR7y5r6fzH1sPQaXo4P7+ev2Hy/xNw9+Ih5ZuofR+0j1s9pI8NV33WL7mrw347vfy2Od0jvsU/T/Pbze6gWaZn7uGhs07IiTXD3S08Zrjzf5+/tLD76pAzwqkwietlX/ebjli/1v79CUkRJXDTSkr63iQ7F6tKSHhD1wxVJN8XdfJRkJb3h9er6FQycBFkaJbQycqdipf1DAt7NbvK0zFbVQ7VSvWXK6p4pd6mC5hjtXsWuZ7MqTgVJN6/7vz2mG34aYP+CUJEm9VotLxN/F1xb7+JUULzzKWFwgjyCGZZN0gNzRep3Hvr/zpP9yBYhJuR6Z/zozf7/ml6UND1UhLUCU4bFZcpkUYbXKCK169F//EKo/cwMMWVoiJkoKShKfMyMB43aWDPMntaXV+PB86c/+WVOGHZWMNVhPDWbfKfbENqtxu23SRDFBW3uMEVsgChq3m2xUfDnykevKPCuAihMC1rh3qgpcDZ7vdue65++fHzdfWU/fXkTzNd6ZW6RV+RIy2vgCT68sYv9MGXqBqY0Sja3E3pdZmjKfPryjeuvjYtJ44bCO4VG7f5fdcoFpuyrqU/fmPljnPYNnGsJ8iqAXk+dpgwYaVcwAN5EBcX5t7w4RDS8yNSaZZE3SeojcokEHQrm20rBbDBlr1PsHpESM/9dJQx7T2y2ItSnL79Xg77eVG5WoqCS/ycV+SvzG7N9YdicqTeMi55B8yjZ1Jlfr4C8Lb6rW6yrW/FtVAleu6v/nmT9XzTG/MZcDinfMez6Xw2g9lGDcPsayLAsKmn6R+LaAGckPTFVd8Ws05y5XrbFlWe3xYpl92LH9HuMj3MarSMfUdyoeajAnRbDBgzL/PLLL8ynL+++IXxlfmU+fXnb93x9UzF/5CbGJwYlwbe+/q94/UEz+0+pfKtaFbDfMvcfC/WPJa+0fAX1e/SuCmyMTxcE3xn2c/ofGr4fzZu8+G43fzyKX/qxqjp8QPSqupTZG5Haz4w5H8z/tAvRKcDJn58YuypkOKjuYT9N9jiv6lFUVOOBZjBVic2ZQ4gT5oAZgsrEDxs1H9FLUtTfIH17NH19i35Vpb7WmV9/fRvCHwjiezkvsxuuzK0NveG7yHGGcsy8b53/f8HkeJdS/F7tkvtF6seYFo3aD/q4u7Wrids766/vYX16fOC478Bk2Z9q/xMAAP//DG/AwDQaAAA=" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 13 -> (known after apply)
        id                      = "lt-0a23e96f3feb1649c"
      ~ latest_version          = 13 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R4a5OjOJb2d0f0f+B1V8Q7E7XYXIwzndPZMcYGX8FGIDDMTjgEyAYjAwnytbr++wa+5GRmVdfM7G7ERucXJ9I5zzk8eqRzRC9LKU4pa51y/MRsd4TGOSpocxsfcfgXxs92aYiK03NdG2mKPIN6vwvceq16Ym1clHGWPjF8g/up9lONZd8a/VS7Y/fjMs/KmF5sEaUoiLY4pX9hVjHBKdri53qcxrQRrNb1f3hZBUrLFS5YJQ2yME7XT8yDH9M3BpeUKT7SZkCyXcgGWbqK1z/VtHiLv0nu57c2tdquxEX5VGMYlqkyeGJwILDVYI1hGKYsoyXa0Sgr4jMOlwk+XWyrP5apl2XEFiViut1uVxb1M+rxp0BQqsd+1+jK3W631zV6x81KHY3IYNVLO3FAhqetUyhyYUGBTNs0MQcWj/OHsDc/H/iN23bSyCDzhZbjeRHrR31BBo+BM+s0gZrLIXfuqAf99DlZraPOanfS3VZn9FlD7dnJsuW1FOmZelyBxUCKhzRomgZJfUWNJ7mZtEicZy3DozLdrrsv68Tstvvn6LT22ztJ68RHa3RsOfJmZ2rcYGGc9U2OV6fY2X0uR+BzJMDCSCZdebcbuYZfbMhnNbK3aLov9idrJuzKGd2nrryJ/PnhNHsQnPkG5ZOw2Yks9DJX+IN6akNVSBdBa74+cOvY8Ntl7KvW+UG38NERJaPz+JIbM0dzJ0G+9gpiouFw4plaRM+zBy30itlUhYvM5Lu4e2qtIxroxUy2iC+Z+/mDeD5zLzJQhaA3a824Qy4dDi/zaH8QUuqLuTWd0xDT8Wdb4ox5mqeLk2mmXi6c1UOABd5fHNsPadQhaTQtvPUGPwSZkc676rEZELGtmOPTOt7NA/nwOeEf3R1xtQV8QTJNDuNpAjb9fGMtBCxpY76d9R/K8TBoNR0pOa2m+1Ar7Sh84XuL4cC2Z/k5W/tcR7LdmAMLNU890OSxve41wWfHPlF35T5yxcqeBWE3EwbeKh1LZxfAxXjc0bwEpcejqDzAWZwoY71Two3Aced273TiRqvRi+WPeVlaPaxCEQWgmLb6gQtDddTk5ZPutFV+8xB4cXcwG090/7xQOUukq8cjh3nj+ZnZok1W/LXAYYRoI8i29fd6x6EgSXznovneVfPE64943VKkamw0l/mNSlp5W7Xk+Di02odZ0l48ppum94CzuW4oTY07TFqP0oTJ/F2I4nfBaocipnhZnQi3bZkjGj0xTbrNr9t7WZ0Ryz0qyktmwfUUeGJ+uyU6M2U4mvaXvZmmjaznRzFAq0eOw5IgCS2/xbdWDyvJX0kIc6EYdHgheOzwHeHm3Ztp85mpgLv7w0rCYjsMO61HXuJWKGj5nNgW20E7FDu+/9DGAn7kw9XH4N1lTwHW89Tk6NTkewCGYyuW+8AeQxN6Y4NTIbjMcbSX8GMTAsVW9L7heAuPU0UTjmWPIzbs64YmuGfdlgcwkXhf8Di81SSrnwhgEEFfAHLIAeDAfOrz+RgNvY2VqADAw8Qgqhxy3guwbd1IyNCwVBtAVQy5Y6xxUu6pYRnweV9feBvf0UVzEG2shH8xFuHcVuy2ZQMPQ16xLX2BBvrMWuRyeMiruda7uURdWPYYhJydOhA40FYVoKhcuNVO5kaNbDEqrAEnYTtvG5wuQ46IQFU9M6F7JyFZuNVnvUvO4x6EquIJoQoVVbnYOp1+9Wwkqm6kcuHYqmvauuaeo6nj5Dq0SYpTGcygLmv8eKptwxHoy0d3oZ7DzXri2uONnWiCTjTJS6IjgPCI4NF2lEdR648B3thnJOSZJuZHa0iGcBOJkLj7qaCPNWd0DDayje3ccrkj0vhAtO38ZBwyTu+DrStmZ2tBWr6qt23e9iAvp0ZCpmgQyrOhSgOSm5rT2boOOOGhbVo9evYTTzEd2tLEoHDP6sSz7Z221UtNDfMesTmnPx4C3usDEuqWoO69BBSOavdBak/NYTiBTjiwhuBsKjpyHH0bktAx1RzpSasVcuFBIypyrJHkniPeX8gvmt2dQMUrHUVreQMVWQofOSqJgSXr5gI4mqKPzFQWAUcObkp2vk2g36NnkNqC3wd7e8Cf8DDb40XUDhQg2Ak/DxJ17Bt5yxdKMSA2tYd2Aga2CvlxzxJCWYOUdyFv2kM7Mhcy8M/jxBe94+TcPYKtezZg62RDXQ45WzYcdWYr/AAswhG0idIjnqkpnZ5BiAqSTPQsz9XE5OANOmVgdiYu8XI3IXkogB3ku4We8L2ZEsqabSfmIgQO5HsuVAfmJiQ6WZ+xJSe+cJj8jq989wWLUDXijgihpxuQ7xmO2/r+vjq+atRY5zJIc0EXCDG5QPLVfBoko5Pl8Agp6tFUiIadY2SJxAmsQARn0rPsMQSpfnBSyGnDkQh4ILocyMLtmgdQ35uqGve2xyK0ZFeHHdfjgOAM9V4w6AzM4VjQFDo3naOl8/ZEW7gHfVDuTUJSZxgU/iCH9lDbzxb5wd9Epr090mAI94Dj55YFJ9AZD2GPztDGRsHZ3gLOWyClJVrWiIcOtWf98cQfRsRM1BIuopEhHPtwYLdgouuupUr6oivaAymd9eWpSUIO27IxM3IOCqFupF1Rt23Tcx45HcIWVPKTmXbPaEj2ujpuzewxAAI9YUc3zUW4NZJIQGKkm1tvFwia6JgdQXcIDzYRxQrf7m10zk0yacLlEoAqbw6zo5uEfAB1dyKqE2gDGPY6wD+7pzAJFy5MJMh7U5doLdeONOM8numpukHO+BhsYMvbAMVMjImZ6qVlPorBUJeCjbrXF4Bzk/FOJwlvLLROL76eyQBKykjRVUjAGCSkb9hAvZ7l3ORjpRjOTOs5TikuUkQaJUXrOF1X1SzPSlw0stLfxSRsZMX6o2e33weKaT7zXEPkGvxjg+dvJs4MTBSwNM3pcqK45rIL9GdUpE/oUD6VOCgwLbcoRWtcPO1KFqOSsvxTRxQfJIHvPHQ6nZvVk1/gw6VvZR9UiDG54ZtQNntgNLdGM32pdfXu4Fbyunr/vx+s3PllUMR51eGzNxc2yLZblIZsYrgk69zju6alaBfq9K6mLOdAUUeL5xt57J1N9pAVya0Xf8NbfwSem5gGzRu37J3sO7rSA4plvr6Yovfns5FuLSGYPkeU5uVTs7nPA8xyIS/yUkvk2lKr4/NByHbOx+LhLO0b79+88frmjcqxgbbonKXoUFYL3XzbqHwvr28GGjTbku/3L39Lsk3899sDIiQ74HAZZlsUpyXzzPyNqVOMtm9lVf8Pph7t/Ea11h/HrwR+O8XcIwSIeWbq3886QGxQ0EaOq8bslt0V8N/O738tjw9M73FAs+L28yNWy2xXBLhsbLJdpazwHpeeclxFvo/f+118DMguxMtdGtPLe9VvMUpc7OMA1//+SkkZp0nZyHb0IyY6lMtLz3pANIiWJFuXd/g4zXf0xtdr6FcycBrmWZzSCuS9XnnMibyPJE4Ukc8FEotf9uvsuBcaFfqPVXqPvS6yXb6srrsV/m3PLe977m5V0gKj7avZdQGX5akk2fqVpNuVvBFkIQ4uNJZZWq/Vil0abMNrA1+eSoq3ASUMTpFPMMOyaXZgrnT+4HPBv3PxP7JlhAm5nj6/d/P/f00/Tps+KqNaiSnD4l3G5HGOVygmtas+vn/PqP3MDDBlaISZOC0pSgPMjPqN2kg3ra7eU5aj/vOnPwW7gjDstGSqFXtqNvl2pyFIrcbtt0kQxSVtbjFFbIgoat6x2Dj8cxWjW5Z4WxEUZSWteG/UVDidvp6Sz/VPX75/cH5lP315k8zXegU3LyoFZbtr4ik+vMHFQZQxdRNTGqfr2wq9TjM0Yz59eRf6a+MCad5Y+ODQqN3/q1a5xJR9hfr0DuaPsdo3cq7FzK8Iel11mjFgqF/JAHgdlxQX73VxiGl0sak1d2XRJFmAyCUTdCiZ9zWFWWPKXofYPSI7zPxntWHY++5nK0F9+vKjavb15nJDicPK/p/U9q/Mb8zmhWELpt4wL34mLeJ0XWd+vRLytowvb7kub2W8UW3w2t39R5b1fxGM+Y25LFKxZdjVv5pA7Xutxu2bIsOyaEezP5LW+jgn2Ymp+jRmlRXM9bAtrzq7TVYqu1dEptdlAlzQeBUHiOJGzUclbrcYNmRY5pdffmE+ffnwJeIr8yvz6cvbDurrm7L6e2ESfGJQGr6P9X+l6+/0xP9UyreqVRH7Xrn/mKh/3/Iqy1dSv2Xv6sAm+HRh8ANwUND/IfB9ad7si2/e5o8n8UvTVlWH7wi9qi67/I1J7WfGmvVnf9pG6BTi9M9PjFMVMhxW53CQpXtcVPUoLqvnvm4yVYktmEOEU+aAGYJ2aRA1agGil01Rf8P07er19S37VZX6Wmd+/fVtCn8giu/lfJffeGVuveqN33mBc1Rg5mN//f9LpsDbjOKPbpe9X2ZBgmnZqP1OH3dHu0Lcbmx//Ujr0+MDx31DJsv+VPuvAAAA//8PyKwZehoAAA==" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210209160527062700000008" -> (known after apply)
      ~ id                                  = "sfr-a007db26-c324-4b9d-8caf-cf37b637254d" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0195b4ef20679c780" -> null
              - version = "15" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0195b4ef20679c780"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210209160506283000000006" -> (known after apply)
      ~ id                                  = "sfr-2f29a128-797e-4240-8e9c-cd8e4b24b5e6" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0a23e96f3feb1649c" -> null
              - version = "13" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0a23e96f3feb1649c"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-1911393042" -> (known after apply)
      ~ instance_id = "i-035379ae62f35ce17" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-2376940936" -> (known after apply)
      ~ instance_id = "i-0f2a613e34ee8496a" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*